DataProcessors/Д_УстановитьПредприятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>Д_УстановитьПредприятие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Д_УстановитьПредприятие/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьПП()
	ПараметрыСеанса.ТекущееПредприятие = Объект.Предприятие;
	
КонецПроцедуры
  
&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	УстановитьПП();
	Если ПустаяСтрока(Объект.Предприятие) Тогда
		Состояние("Не выбрано предприятие в качестве основного. Для удобной работы необходимо выбрать основное предприятие.");
	Иначе
		Состояние("Предприятие " + Строка(Объект.Предприятие) + " выбрано в качестве основного.");	
	КонецЕсли;                                                                                    	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Предприятие = БюджетныйНаСервере.ПолучитьПредприятие();
	Если НЕ ПустаяСтрока(Объект.Предприятие) Тогда
		Если БюджетныйНаСервере.ПолучитьПредприятия(1).Количество() > 1 Тогда
			Элементы.Предприятие.Доступность = 1;
		Иначе
			Элементы.Предприятие.Доступность = 0;
		КонецЕсли;         	
	КонецЕсли;
	Если БюджетныйНаСервере.РольДоступнаСервер("Администратор") Тогда
		Объект.Пользователь = БюджетныйНаСервере.ПолучитьПользователя();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТекущееПредприятие()
	ПараметрыСеанса.ТекущееПредприятие = Справочники.Предприятия.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Предприятия.Форма.ФормаВыбораИзМассива", Новый Структура("Флаг, ТекущаяСтрока", Предприятия(), Объект.Предприятие), Элемент);
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователя()
	ПараметрыСеанса.ТекущийПользователь = Объект.Пользователь;
	ПараметрыСеанса.ДоступныеПредприятия = Новый ФиксированныйМассив(Новый Массив);
	БюджетныйНаСервере.НайтиИУстановитьПользователя(Новый Структура("Наименование", ПараметрыСеанса.ТекущийПользователь.Наименование)); 
	ПараметрыСеанса.ДоступныеПользователи =  Новый ФиксированныйМассив(БПСервер.ПолучитьМассивПользователей());
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция Предприятия()

	Возврат ПараметрыСеанса.ДоступныеПредприятия;	

КонецФункции // ()

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	УстановитьПользователя();
КонецПроцедуры

&НаСервере
Процедура РабочаяДатаПриИзмененииНаСервере()

	ОбщегоНазначения.УстановитьРабочуюДатуПользователя(Объект.РабочаяДата, ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочаяДатаПриИзменении(Элемент)
	РабочаяДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РабДата = ОбщегоНазначения.РабочаяДатаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если ЗначениеЗаполнено(РабДата) Тогда
		Объект.РабочаяДата = РабДата;
	КонецЕсли;	
	
КонецПроцедуры
